Revit 2027 API
BuiltInFailures.CutFailures.CannotCutInstanceOut Property
 Can't cut instance of [Symbol] out of Wall.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCutInstanceOut { get; }
Public Shared ReadOnly Property CannotCutInstanceOut As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCutInstanceOut {
	FailureDefinitionId^ get ();
}
static member CannotCutInstanceOut : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CutFailures Class
Autodesk.Revit.DB Namespace